In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [12]:
df = pd.read_csv('4. Revenue by actors.csv')

In [13]:
df

,film_id,actor_id,first_name,title,rental_rate,actor_count,rank
0,933,40,Johnny,Vampire Whale,4.99,1,1
1,989,37,Val,Working Microcosmos,4.99,1,1
2,412,193,Burt,Heavyweights Beast,4.99,1,1
3,144,180,Jeff,Chinatown Gladiator,4.99,1,1
4,853,189,Cuba,Stranger Strangers,4.99,1,1
...,...,...,...,...,...,...,...
5457,728,12,Karl,Reunion Witches,0.99,1,3603
5458,281,11,Zero,Encino Elf,0.99,1,3603
5459,517,178,Lisa,Lesson Cleopatra,0.99,1,3603
5460,646,156,Fay,Outbreak Divine,0.99,1,3603
5461,981,67,Jessica,Wolves Desire,0.99,1,3603

In [19]:
df[(df.columns)[6]]

0       1
1       1
2       1
3       1
4       1
       ..
5457    1
5458    1
5459    1
5460    1
5461    1
Name: rank, Length: 5462, dtype: int64

In [28]:
df['first_name']

0        Johnny
1           Val
2          Burt
3          Jeff
4          Cuba
         ...
5457       Karl
5458       Zero
5459       Lisa
5460        Fay
5461    Jessica
Name: first_name, Length: 5462, dtype: object

In [30]:
if df['rank'] > 0 and df['rank'] <= 10:
 df['first_name']

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().